#include "key.h"

unsigned char Key_Read()
{
	/*独立按键*/
	//略
	/*矩阵键盘*/
	//如果需要测量频率，需要注释所有P34！！！
	unsigned char temp = 0;//一定注意初始化！！！
	//判断串口使用与否,是-返回0,否-继续运行
	P44 = 1;P42 = 1;P35 = 1;P34 = 1;
	if(P30 == 0) return 0;
	P44 = 0;P42 = 1;P35 = 1;P34 = 1;
	if(P30 == 0) temp = 7;
	if(P31 == 0) temp = 6;
	if(P32 == 0) temp = 5;
	if(P33 == 0) temp = 4;
	//判断串口使用与否,是-返回0,否-继续运行
	P44 = 1;P42 = 1;P35 = 1;P34 = 1;
	if(P30 == 0) return 0;
	P44 = 1;P42 = 0;P35 = 1;P34 = 1;
	if(P30 == 0) temp = 11;
	if(P31 == 0) temp = 10;
	if(P32 == 0) temp = 9;
	if(P33 == 0) temp = 8;
	//判断串口使用与否,是-返回0,否-继续运行
	P44 = 1;P42 = 1;P35 = 1;P34 = 1;
	if(P30 == 0) return 0;
	P44 = 1;P42 = 1;P35 = 0;P34 = 1;
	if(P30 == 0) temp = 15;
	if(P31 == 0) temp = 14;
	if(P32 == 0) temp = 13;
	if(P33 == 0) temp = 12;
	//判断串口使用与否,是-返回0,否-继续运行
	P44 = 1;P42 = 1;P35 = 1;P34 = 1;
	if(P30 == 0) return 0;
	P44 = 1;P42 = 1;P35 = 1;P34 = 0;
	if(P30 == 0) temp = 19;
	if(P31 == 0) temp = 18;
	if(P32 == 0) temp = 17;
	if(P33 == 0) temp = 16;
	
	// --- 扫描结束，恢复端口状态 ---
  // 确保所有行线在函数退出时都恢复为高电平。
	P44 = 1;P42 = 1;P35 = 1;P34 = 1;
	P3 |= 0xef;//不影响频率测量
	
	return temp;
}